Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Ortsfeste Vorwärmbrenner
en: Fixed pre-heating burners

source: Elektrische Lampen zur Innenraumbeleuchtung
en: Electrical lamps for indoor lighting

source: Heizplatten zum Kochen
en: Hot plates for cooking

source: Solarien, ausgenommen für medizinische Zwecke
en: Solaria, other than for medical purposes

source: Öfen für industrielle Zwecke
en: Furnaces for industrial use

source: Gaskessel für Zentralheizungsanlagen
en: Gas boilers for central heating

source: Tragbare Handlampen [für Beleuchtungszwecke]
en: Portable hand lamps [for illumination]

source: Hochleistungsfilter für die Wasserreinigung [ausgenommen Maschinen]
en: Power filters for water purification [other than machines]

source: Vorgefertigte Ofenteile
en: Prefabricated furnace elements

source: Elektrische Ventilatoren als Teile von Haushaltsbelüftungsanlagen
en: Electrical fans being parts of household ventilation installations

source: Elektrische Härtöfen für zahnmedizinische Zwecke
en: Electrical hardening ovens for dental purposes

source: Beleuchtungslampen für Nummernschilder
en: Registration plates (Illumination lights for -)

source: Regelgeräte als Teile von Wasserleitungen
en: Regulating apparatus being parts for water pipes

source: Schmelzöfen [für industrielle Zwecke]
en: Melting furnaces [for industrial purposes]

source: Drehrohröfen [für industrielle Zwecke]
en: Rotary kilns [for industrial purposes]

source: Elektrische oder nicht elektrische Fußwärmer
en: Footwarmers, electric or non-electric

source: Scheinwerfer für Motorräder
en: Headlamps for use on motor cycles

source: Scheinwerfer für Beleuchtungszwecke im Haushalt
en: Spot lights for household illumination

source: Niveauregelventile für Tanks
en: Level controlling valves in tanks

source: Anlagen zum Abbrennen von Flüssigkeiten
en: Installations for the burning off of liquids

source: Mischventile [Wasserhähne] für Spülbecken
en: Mixing valves [faucets] for sinks

source: Belüfter für Wasserhähne [Sanitärarmaturen]
en: Aerators for faucets [plumbing fittings]

source: Heizgeräte für feste Brennstoffe
en: Heating apparatus for solid fuels

source: Fassungen für elektrische Lampen
en: Sockets for electric lights

source: Heißwasserraumheizgeräte [für gewerbliche Zwecke]
en: Hot-water space heating apparatus [for industrial purposes]

source: Elektrische Kotatsus [japanische elektrische Beinwärmgeräte für Haushaltszwecke]
en: Japanese electric leg-warming apparatus for household purposes (electric kotatsu)

source: Industrieanlagen zur Filterung von Flüssigkeiten
en: Industrial installations for filtering liquids

source: Leuchten für Außenanlagen
en: Lights for external installation

source: Leuchten für Gasentladungslampen
en: Lights for gas-discharge lamps

source: Leuchten für Lichterketten
en: Lights for track mounting

source: Auskleidungen für Feuerstellen
en: Linings for fire openings

source: Betätigungshebel für Toilettenspülkästen
en: Operating levers for water closet cisterns

source: Duschen für den Außenbereich
en: Outdoor showers for bathing

source: Kochherde mit Nutzung von Luftfrequenzfeldern
en: Ovens utilising air frequency fields for cooking

source: Ventile für Klimaanlagen
en: Valves for air conditioners

source: Elektrische Handtuchwärmer
en: Electric towel warmers

source: Gesichtstrockner, die warme Luft verwenden
en: Dryers for the face using warm air

source: Dampfüberhitzer [für industrielle Zwecke]
en: Steam superheaters [for industrial purposes]

source: Ionisationsgeräte zur Behandlung von Luft oder Wasser
en: Ionization apparatus for the treatment of air or water

source: Bogenlampen
en: Arc lamps

source: Sterilisierapparate für medizinische Zwecke
en: Sterilising apparatus for medical use

source: Absperrhähne für die Wasserregelung
en: Stop cocks for regulating water

source: Ultraviolettlampen, nicht für den medizinischen Gebrauch
en: Ultraviolet sun ray lamps, other than for medical use

source: Elektrische Kochgeräte
en: Cooking utensils, electric

source: Rauchabzüge für Öllampen
en: Chimneys for oil lamps

source: Kessel als Teile von Zentralheizungsanlagen
en: Boilers being parts of central heating installations

source: Kessel für Heizungssysteme
en: Boilers for use in heating systems

source: Sprinklermaschinen zur Bewässerung in der Landwirtschaft
en: Sprinkler machines for agricultural irrigation

source: Beregnungsgeräte [automatisch], ausgenommen Maschinen
en: Sprinkling devices [automatic], other than machines

source: Gaswäscher [Teile von Gasanlagen]
en: Gas scrubbers [parts of gas installations]

source: Ventilatoren [Teile von Klimaanlagen]
en: Fans [parts of air-conditioning installations]

source: Anlagen zum Rösten von Nüssen
en: Installations for the roasting of nuts

source: Leuchten für Sicherheitszwecke
en: Luminaires for security use

source: Membranen zur Wasserfilterung
en: Membranes for the filtration of water

source: Anlagen zum Verdampfen
en: Installations for evaporating

source: Trennwände für Duschbäder, nicht aus Metall
en: Non-metallic screens for shower baths

source: Trennwände für Duschbecken, nicht aus Metall
en: Non-metallic screens for shower trays

source: Filter für Gasabzüge
en: Filters for gas extractors

source: Reaktoren für Gas-Feststoff-Reaktionen
en: Reactors for gas-solids reactions

source: Raumluftbefeuchter [Apparate]
en: Room humidifiers [apparatus]

source: Sicherheitsventile für Gasgeräte
en: Safety valves for gas apparatus

source: Luftreinigungsgeräte für Reinraumkabinen
en: Clean air booths (Air purification apparatus for -)

source: Wäschetrockengeräte [Wärmetrocknung]
en: Clothes drying apparatus [heat drying]

source: Konvektoren [Heizkörper]
en: Convectors [radiators]

source: Bewässerungsapparate [automatisch] für Gartenzwecke
en: Watering apparatus [automatic] for garden use

source: Brennöfen, ausgenommen für Laborzwecke
en: Furnaces, other than for laboratory use

source: Geräte zur Ultraviolettsterilisation von Wasser für gewerbliche Zwecke
en: Ultra-violet water sterilisation units for industrial use

source: Brenner zum Verbrennen von Gas in Kesseleinheiten
en: Burners for the combustion of gas in boiler units

source: Gusseisenteile für Rohre [Teile von sanitären Anlagen]
en: Cast iron parts for pipes [parts of sanitary installations]

source: Heizungsgeräte mit katalytischer Verbrennung
en: Catalytic combustion heating apparatus

source: Filter zur Verwendung an Geräten für sanitäre Zwecke
en: Filters for use with apparatus for sanitary purposes

source: Elektrische Wärmflaschen
en: Electric hot-water bottles

source: Gasherde mit Flammen in bandartiger Form
en: Gas stoves employing flames in ribbon-like form

source: Glasschirme für Lampen
en: Glass covers for lamps

source: Umkehrosmoseelemente zur Verminderung der Brackigkeit von Wasser
en: Reverse osmosis elements for reducing the brackishness of water

source: Weihnachtsbeleuchtung [ausgenommen Kerzen]
en: Christmas lights [other than candles]

source: Abscheider zur Luftwäsche
en: Separators for scrubbing air

source: Aufhängeschienen [nicht elektrisch] für elektrische Beleuchtungskörper
en: Suspension rails [not electrified] for electrical lighting fixtures

source: Heizgeräte für Laborbehälter
en: Heaters for laboratory containers

source: Ortsfeste Druckluftbrenner
en: Fixed compressed air burners

source: Elektrische Duschgeräte
en: Electric shower apparatus

source: Elektrische Fußwärmer [ausgenommen für medizinische Zwecke]
en: Electric foot warmers [other than for medical use]

source: Elektrische Sandwichbereiter
en: Electric sandwich makers

source: Sockel für Toiletten
en: Pedestals for lavatories

source: Zündflammen zum Zünden gasbeheizter Apparate
en: Pilot lights for igniting gas fired apparatus

source: Wasserregelventile [Sicherheitszubehör]
en: Water regulating valves [safety accessories]

source: Elektrische Teemaschinen
en: Tea urns (Electric -)

source: Abscheider zur Gasreinigung
en: Separators for scrubbing gas

source: Setzapparate für Abfall
en: Settler apparatus for waste

source: Elektrostatische Abscheider für die Gasreinigung
en: Electrostatic precipitators for cleaning gases

source: Kombinierte Kochherde und Gasbehältern
en: Combined cooking stoves and gas containers

source: Waschtischunterschränke mit Waschbecken [angeschlossen an die Wasserversorgung]
en: Vanity units incorporating basins [connected to the water supply]

source: Ortsfeste Flammhärtungsbrenner
en: Fixed flame hardening burners

source: Elektrische Leuchtstoffröhren
en: Flourescent electric light bulbs

source: Elektrische Heizkissen, ausgenommen für medizinische Behandlungszwecke
en: Electrical heating pads, other than for medical [treatment] use

source: Heizungsanlagen zum Einbau in Fenster
en: Heating installations incorporated in windows

source: Heizgeräte für feste, flüssige oder gasförmige Brennstoffe
en: Heating apparatus for solid, liquid or gaseous fuels

source: Handbetätigte transportable Wasserreinigungsgeräte
en: Hand held portable water purification apparatus

source: Kraftstoffbrenner für die katalytische Verbrennung von Kraftstoff
en: Fuel burner elements for the catalytic combustion of fuel

source: Öfen zur Metallrückgewinnung
en: Furnaces for recovering metals

source: Mischhähne für Wasserleitungen
en: Mixer taps for water pipes

source: Befeuchtungsgeräte, ausgenommen für medizinische Zwecke
en: Humidifying apparatus, other than for medical use

source: Kochgeräte zur Verwendung im Freien
en: Apparatus for cooking out of doors

source: Tragbare Suchscheinwerfer
en: Portable search lamps

source: Transportable Dampfsterilisationsgeräte
en: Portable steam sterilizing apparatus

source: Elektrische Ventilatoren als Teile von Haushaltsklimaanlagen
en: Electrical fans being parts of household airconditioning installations

source: Sterilisatoren [nicht für medizinische Zwecke]
en: Sterilizers [not for medical purposes]

source: Füllständer für Öfen
en: Kiln furniture [supports]

source: Scheinwerfer für Fahrräder
en: Headlamps for use on cycles

source: Wärmetauscher zur Beseitigung von Abgasen
en: Heat exchangers for the removal of exhaust gases

source: Öfen für beschleunigte Alterung
en: Accelerated ageing furnaces

source: Mikrowellengeräte [Kochgeräte]
en: Microwave ovens [cooking apparatus]

source: Sprühanlagen für die automatische Bewässerung von Feldern
en: Spray installations for the automatic watering of fields

source: Automatische Sprühanlagen für die Bewässerung
en: Sprayers [automatic installations] for watering

source: Waschbecken [Teile von Sanitäreinrichtungen]
en: Wash-hand basins [parts of sanitary installations]

source: Elektrische Christbaumbeleuchtungen
en: Lights, electric, for Christmas trees

source: Temperaturbegrenzer [Ventile] für Zentralheizungskörper
en: Temperature limiters [valves] for central heating radiators

source: Diskokugeln als Beleuchtungskörper
en: Mirror balls being lighting fittings

source: Desodorierungsgeräte für die Abgabe von Duftstoffen in Kraftfahrzeugen
en: Deodorising apparatus for dispensing scents in motor vehicles

source: Wärmetauscher für Kamine
en: Heat exchangers for fireplaces

source: Ventile [Sanitärarmaturen]
en: Valves [plumbing fittings]

source: Luftabzughauben für Küchenherde
en: Air extractor hoods for use with cookers

source: Luftfilter zum Absaugen von Staub in Industrieverfahren
en: Air filters for use as dust extractors in industrial processes

source: Kronleuchter
en: Chandeliers

source: Heizdecken [nicht für medizinische Zwecke]
en: Blankets, electric, not for medical purposes

source: Düsen für Hydrotherapiebäder
en: Jets for hydrotherapy baths

source: Ständer für Öfen
en: Supports for kilns

source: Lampenzylinder aus Glas
en: Lamp chimneys made of glass

source: Schleusen [sanitäre Anlagen] zur Verwendung in Krankenhäusern
en: Sluices [sanitary installations] for use in hospitals

source: Kochgeräte zum Räuchern
en: Smoke cooking units

source: Wasserverteilungsarmaturen für Heizungen
en: Water distributor armatures for heating

source: Duschen
en: Showers

source: Shichirins [japanische Kohlekochherde für Haushaltszwecke]
en: Japanese charcoal cooking stoves for household purposes (shichirin)

source: Öfen zur Abfallbehandlung
en: Ovens for the treatment of waste

source: Reflektoren für Beleuchtungskörper für große Flächen
en: Reflectors for wide area lighting fixtures

source: Berührungsfreie Händetrockner
en: Touchless hand drying apparatus

source: Elektrische Reisdämpfer
en: Electric rice steamer

source: Elektrische Raumheizgeräte
en: Electric space heaters

source: Haarwaschbecken für Friseursalons
en: Shampoo basins for barbers' shop use

source: Dampfheizungsgeräte [für gewerbliche Zwecke]
en: Steam heating apparatus [for industrial purposes]

source: Klimaapparate [für industrielle Zwecke]
en: Air conditioning apparatus for industrial use

source: Gasbeheizte Heizkessel für Warmwassersysteme im Haushalt
en: Gas fired back boiler units for domestic hot water systems

source: Gasbeheizte kombinierte Herd- und Schachtöfen zur Verwendung in der Stahlproduktion
en: Gas fired combined hearth-type and shaft furnaces for use steel production

source: Gasbeheizte Heizungsanlagen
en: Gas fired heating installations

source: Gas-Wasser-Erhitzer
en: Gas fired water heaters

source: Thermische Sonnenkollektoren [Heizung]
en: Solar thermal collectors [heating]

source: Keramikplatten als Teile von Kochfeldern
en: Ceramic plates sold as parts of hobs

source: Keramikplatten als Teile von Öfen
en: Ceramic plates sold as parts of stoves

source: Lampen für Weihnachtsbäume
en: Lamps for christmas trees

source: Einzeltoiletten in Form von Kompakttoiletten
en: Single lavatories being close coupled

source: Beleuchtungsapparate und -anlagen
en: Lighting apparatus and installations

source: Leitungen [Teile von sanitären Anlagen]
en: Pipes [parts of sanitary installations]

source: Rohrschlangen [Teile von Destillier-, Heizungs- oder Kühlanlagen]
en: Coils [parts of distilling, heating or cooling installations]

source: Automatische Aschentransportanlagen
en: Ash conveyor installations, automatic

source: Anlagen zur Wasseraufbereitung nach dem Osmoseverfahren
en: Installations for water treatment under osmotic process

source: Sockel für die Anbringung von Lampen
en: Bases adapted for the mounting of lamps

source: Mischbatterien [Hähne]
en: Basin mixers [taps]

source: Ultraviolettgeräte zur Gesichtsbräunung
en: Ultra-violet apparatus for tanning the face

source: Ultraviolettapparate zur Bräunung des ganzen Körpers
en: Ultra-violet apparatus for tanning the whole body

source: Absaugeinheiten [Lüftung]
en: Extractor units [ventilation]

source: Filter für Rauchabzüge
en: Filters for fume extractors

source: Filter für Teiche
en: Filters for ponds

source: Sanitärablaufarmaturen für Badewannen
en: Sanitary drain armatures for baths

source: Luftreinigungsgeräte für Reinraumschränke
en: Clean air cabinets (Air purification apparatus for -)

source: Kühlanlagen zum Einfrieren
en: Cooling installations for freezing

source: Automatische Temperaturregler [Ventile] für Zentralheizungskörper
en: Appliances for water filtration [other than machines]

source: Platten [Teile von Öfen]
en: Plates [parts of ovens]

source: Transportable Urinale den Außenbereich
en: Portable urinals for outdoor activities

source: Duschschläuche für Handbrausen
en: Shower hoses for hand showers

source: Höhenverstellbare Badewannen für Körperbehinderte
en: Variable height baths for use by the physically handicapped

source: Wasserhähne als Teile von sanitären Anlagen
en: Water taps being parts of sanitary installations

source: Lichtquellen, ausgenommen für fotografische oder medizinische Zwecke
en: Light sources [other than for photographic or medical use]

source: Sanitärwaren aus Steingut
en: Sanitary ware made of stoneware

source: Elektrische Bräter
en: Electric broiling pans

source: Leuchtstofflampen mit niedriger UV-Licht-Abgabe
en: Fluorescent lamps with low ultra-violet light output

source: Verdampfer für chemische Verfahren
en: Evaporators [for chemical processing]

source: Biologische Reaktoren zur Klärung von Industrieabwässern
en: Biological reactors for clarifying industrial effluents

source: Geräte zum Kochen von Nahrungsmitteln
en: Appliances for cooking foodstuffs

source: Kochplatten
en: Cooking rings

source: Fahrtlichter für Boote
en: Running lights for boats

source: Christbaumschmuck für Beleuchtungszwecke [elektrische Leuchten]
en: Christmas tree ornaments for illumination [electric lights]

source: Durchlauföfen zum Härten von Firnissen
en: Continuous furnaces for tempering lacquers

source: Thermostatische Steuerventile für Zentralheizungskörper
en: Control valves (Thermostatic -) for central heating radiators

source: Selbstleuchtende Lichtquellen
en: Self-luminous light sources

source: Raumheizkörper mit Luftzirkulation zur horizontalen Montage
en: Forced air type horizontally disposed space heaters

source: Abzugshauben mit Absauggebläsen
en: Hoods incorporating extractor fans

source: Druckentlastungsgeräte als Teil von Wasserversorgungssystemen
en: Pressure relief apparatus forming part of water supply systems

source: Druckbegrenzungsventile [Sicherheitsapparate] für Wasserleitungen
en: Pressure relief valves [safety apparatus] for water pipes

source: Händetrockengeräte [Wärmetrocknung]
en: Hand drying apparatus [heat drying]

source: Händetrockengeräte mit Ventilatoren
en: Hand drying apparatus incorporating fans

source: Armaturen für Bidets
en: Fittings for bidets

source: Beleuchtungsschienen [Beleuchtungsgeräte]
en: Lighting tracks [lighting apparatus]

source: Wärmespeichergeräte für Heizzwecke [Solarenergie]
en: Thermal storage instruments [solar energy] for heating

source: Öfen zum Beizen von Altmetallen
en: Furnaces for de-coating scrap metals

source: Elektrische Teelichte
en: Tea warmers (Electric -)

source: Elektrisch betriebene Luftgebläse für Klimatisierungszwecke
en: Electrically powered air blowers for air-conditioning purposes

source: Elektrisch betriebene Luftgebläse für Lüftungszwecke
en: Electrically powered air blowers for ventilation purposes

source: Lampenschirme zur Lichtsteuerung
en: Screens for controlling light

source: Kombinierte Heizungs- und Klimageräte
en: Combined heating and air conditioning apparatus

source: Kombinierte Beleuchtungs- und Ultraviolettgeräte
en: Combined lighting and ultraviolet apparatus

source: Waschtisch als Handwaschbecken
en: Vanity units being wash hand basins

source: Dunstabzugshauben für Küchenherde
en: Vapour extractor hoods for kitchen stoves

source: Heizungsanlagen für gewerbliche Zwecke
en: Heating installations for industrial use

source: Beleuchtungsanlagen für Luftfahrzeuge
en: Lighting installations for air vehicles

source: Umweltfreundliche Flachheizgeräte mit Temperatur-Selbstregelung
en: Organic positive self-temperature control plane heaters

source: Elektrische Heizfäden
en: Heating filaments, electric

source: Befeuchtungsapparate zur Verwendung mit Klimageräten
en: Humidification apparatus for use with air conditioning apparatus

source: Apparate zum Entkalken von Wasser
en: Apparatus for descaling water

source: Tragbare Dekontaminierungsapparate
en: Portable decontamination apparatus

source: Tragbare Lampen [für die Beleuchtung]
en: Portable lamps [for illumination]

source: Transportable Öfen
en: Portable stoves

source: Kühlvorrichtungen für Arbeitsplatten
en: Refrigeration in the form of benches

source: Regelgeräte als Teile von Wasserapparaten
en: Regulating apparatus being parts for water apparatus

source: Lokalwirkende Klimaanlagen [für gewerbliche Zwecke]
en: Locally induced air-conditioners [for industrial purposes]

source: Elektrische Babyflaschenwärmer
en: Heaters, electric, for feeding bottles

source: Räucherapparate, nicht für medizinische Zwecke
en: Fumigation apparatus, not for medical purposes

source: Gaskondensatoren [ausgenommen Maschinenteile]
en: Gas condensers, other than parts of machines

source: Wärmetauscher zur Kondensatbeseitigung
en: Heat exchangers for the removal of condensate

source: Wärmepumpen zur Energieverarbeitung
en: Heat pumps for energy processing

source: Elektrische Wäschetrockner
en: Laundry dryers, electric

source: Anlagen zur Bearbeitung von Kernbrennstoffen und Kernreaktionsbremsern
en: Processing installations for fuel and nuclear moderating material

source: Temperaturregelventile [Teile von Zentralheizungsanlagen]
en: Temperature control valves [parts of central heating installations]

source: Mischventile [Wasserhähne] für Waschbecken
en: Mixing valves [faucets] for basins

source: Waschbeckensiebe [Sanitärarmaturen]
en: Sink strainers [plumbing fittings]

source: Wasserhahnsiebe [Sanitärarmaturen]
en: Faucet filters [plumbing fittings]

source: Regelventile für Duschen [Sanitärarmaturen]
en: Shower control valves [plumbing fittings]

source: Desinfektionsmittelspender für Toiletten
en: Disinfectant dispensers for toilets

source: Elektrisch beheizte Teppiche
en: Electrically heated carpets

source: Heizgeräte zur Verwendung bei der Behandlung von Metall
en: Heating apparatus for use in the treatment of metal

source: Wasserversorgungsanlagen für Badezimmer
en: Bathroom installations for water supply purposes

source: Wasserregelventile für Wasserhähne
en: Water control valves for faucets

source: Wasserfilter [Maschinen] für landwirtschaftliche Zwecke
en: Water filters [installations] for agricultural purposes

source: Kamados [japanische Küchenherde]
en: Japanese kitchen furnaces (kamado)

source: Industrielle Heizungsanlagen
en: Industrial heating installations

source: Industrielle Lüftungsapparate
en: Industrial ventilation apparatus

source: Öfen, die Funkfrequenzfelder zu Trocknungszwecken nutzen
en: Ovens utilising air frequency fields for drying purposes

source: Beleuchtungsanlagen für Filmbühnen
en: Film stage lighting apparatus

source: Chlorierungsgeräte für Schwimmbecken
en: Swimming pool chlorinating apparatus

source: Thermostatventile [Teile von Heizungsanlagen]
en: Thermostatic valves [parts of heating installations]

source: Öfen zum Verzinnen
en: Tinning furnaces

source: Toilettensitze mit automatischem Austausch der Hygieneabdeckung vor der Benutzung
en: Toilet seats with automatic sanitary cover replacement before use

source: Toiletten mit Waschfunktionen
en: Toilets with washing functions

source: Handbetätigte Sanitärventile
en: Manually-operated plumbing valves

source: Elektrische Sandwich-Toaster
en: Electric sandwich toasters

source: Dynamoleuchten für Fahrzeuge
en: Dynamo lights for vehicles

source: Wasserkühler und -erhitzer
en: Water coolers and heaters

source: Luftdüsenbalken für Trockner
en: Air bars for use in dryers

source: Gasbeheizte Heizkessel für die Zentralheizung im Haushalt
en: Gas fired back boiler units for domestic central heating

source: Gasbeheizte Raumheizungsanlagen
en: Gas fired space heating apparatus

source: Gasvorwärmgeräte für gewerbliche Zwecke
en: Gas pre-heating apparatus for industrial use

source: Beschickungsanlagen für gewerbliche Öfen
en: Stokers for use with commercial furnaces

source: Beschickungsanlagen für Industrieöfen
en: Stokers for use with industrial furnaces

source: Geschirrdesinfektionsapparate für gewerbliche Zwecke
en: Dish disinfectant apparatus for industrial purposes

source: Elektrische Kerzen
en: Electric candles

source: Pfannen, elektrisch
en: Electric casseroles

source: Elektrische Lampions
en: Electric chinese lanterns

source: Brenner für Heizkessel
en: Burners for boilers

source: Brenner für gewerbliche Zwecke
en: Burners for industrial use

source: Duschen zum Verkauf als Einbausatz
en: Showers for sale in kit form
